app/controllers/players_controller.rb

    def new
        @player = Player.new
        @teams = Team.all
---
SELECT "teams".* FROM "teams"

    def create
        player = Player.create(player_params)
---
INSERT INTO "players" ("name", "team_id") VALUES (?, ?)  [["name", "Hector Polanco"], ["team_id", 181]]

    def edit
        @player = Player.find(params[:id])
        @teams = Team.all
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 492], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"

    def update
        player = Player.find(params[:id])
        player.update(player_params)
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 391], ["LIMIT", 1]]
UPDATE "players" SET "team_id" = ? WHERE "players"."id" = ?  [["team_id", 206], ["id", 391]]

    def show
        @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def delete
        player = Player.find(params[:id])
        player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 187], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 187]]