app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @team = Team.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 493], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 493]]
---
    def delete
        @player = Player.find(params[:id])
        @player.destroy