app/models/player.rb

SELECT "players".* FROM "players"
---
    def self.highest_points_per_game
        @players = Player.all
        @players.map do |player|

SELECT "players".* FROM "players"
---
    def self.highest_rebounds_per_game
        @players = Player.all
        @players.map do |player|

SELECT "players".* FROM "players"
---
    def self.highest_per_game(arg)
        @players = Player.all
        @players.map do |player|